#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Даны действительные числа А,В,С.
Найти максимальное и минимальное из этих чисел.
Выполнила: Хацукова Аделаида.
"""

A = int(input("Введите число А: "))
B = int(input("Введите число B: "))
C = int(input("Введите число С: "))
print(f"Максимальное число: {max(A,B,C)}")
print(f"Минимальное число: {min(A,B,C)}")
